## 🚨 Production

📝 **13** add, **1** change, **0
0** destroy

<details>
<summary>📋 Click to view full plan details</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_application_insights.main has been deleted
  - resource "azurerm_application_insights" "main" {
      - connection_string                     = (sensitive value) -> null
        id                                    = "/subscriptions/e1451471-4877-40c5-b65c-46fab5c164f6/resourceGroups/rg-webapp-prod/providers/Microsoft.Insights/components/appi-webapp-prod"
      - instrumentation_key                   = (sensitive value) -> null
        name                                  = "appi-webapp-prod"
        tags                                  = {
            "Component"       = "Monitoring"
            "CostCenter"      = "Engineering"
            "Criticality"     = "High"
            "Environment"     = "prod"
            "ManagedBy"       = "Terraform"
            "Owner"           = "DevTeam"
            "Project"         = "webapp"
            "SecurityControl" = "High"
            "Service"         = "ApplicationInsights"
        }
        # (14 unchanged attributes hidden)
    }

  # azurerm_key_vault.main has been deleted
  - resource "azurerm_key_vault" "main" {
      - id                              = "/subscriptions/e1451471-4877-40c5-b65c-46fab5c164f6/resourceGroups/rg-webapp-prod/providers/Microsoft.KeyVault/vaults/kv-webapp-prod-3i8r0t" -> null
      - name                            = "kv-webapp-prod-3i8r0t" -> null
        tags                            = {
            "Component"       = "Security"
            "CostCenter"      = "Engineering"
            "Criticality"     = "High"
            "Environment"     = "prod"
            "ManagedBy"       = "Terraform"
            "Owner"           = "DevTeam"
            "Project"         = "webapp"
            "SecurityControl" = "High"
            "Service"         = "KeyVault"
        }
      - vault_uri                       = "https://kv-webapp-prod-3i8r0t.vault.azure.net/" -> null
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_log_analytics_workspace.main has been deleted
  - resource "azurerm_log_analytics_workspace" "main" {
      - id                                      = "/subscriptions/e1451471-4877-40c5-b65c-46fab5c164f6/resourceGroups/rg-webapp-prod/providers/Microsoft.OperationalInsights/workspaces/log-webapp-prod" -> null
        name                                    = "log-webapp-prod"
        tags                                    = {
            "Component"       = "Monitoring"
            "CostCenter"      = "Engineering"
            "Criticality"     = "High"
            "Environment"     = "prod"
            "ManagedBy"       = "Terraform"
            "Owner"           = "DevTeam"
            "Project"         = "webapp"
            "SecurityControl" = "High"
            "Service"         = "LogAnalytics"
        }
      - workspace_id                            = "1dd319e7-a23f-4095-8545-f76c6ad10e04" -> null
        # (15 unchanged attributes hidden)
    }

  # azurerm_mssql_server.main has been deleted
  - resource "azurerm_mssql_server" "main" {
      - administrator_login_password_wo              = (write-only attribute) -> null
      - fully_qualified_domain_name                  = "sql-webapp-prod-3i8r0t.database.windows.net" -> null
      - id                                           = "/subscriptions/e1451471-4877-40c5-b65c-46fab5c164f6/resourceGroups/rg-webapp-prod/providers/Microsoft.Sql/servers/sql-webapp-prod-3i8r0t" -> null
      - name                                         = "sql-webapp-prod-3i8r0t" -> null
        tags                                         = {
            "Component"       = "Database"
            "CostCenter"      = "Engineering"
            "Criticality"     = "High"
            "Environment"     = "prod"
            "ManagedBy"       = "Terraform"
            "Owner"           = "DevTeam"
            "Project"         = "webapp"
            "SecurityControl" = "High"
            "Service"         = "SQLServer"
        }
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_resource_group.main has been deleted
  - resource "azurerm_resource_group" "main" {
      - id         = "/subscriptions/e1451471-4877-40c5-b65c-46fab5c164f6/resourceGroups/rg-webapp-prod" -> null
      - location   = "eastus" -> null
      - name       = "rg-webapp-prod" -> null
        tags       = {
            "CostCenter"      = "Engineering"
            "Criticality"     = "High"
            "Environment"     = "prod"
            "ManagedBy"       = "Terraform"
            "Owner"           = "DevTeam"
            "Project"         = "webapp"
            "SecurityControl" = "High"
        }
        # (1 unchanged attribute hidden)
    }

  # module.storage_account_main.azurerm_storage_account.this has been deleted
  - resource "azurerm_storage_account" "this" {
      - access_tier                        = "Hot" -> null
      - account_kind                       = "StorageV2" -> null
      - account_replication_type           = "GRS" -> null
      - account_tier                       = "Standard" -> null
      - allow_nested_items_to_be_public    = false -> null
      - cross_tenant_replication_enabled   = false -> null
      - default_to_oauth_authentication    = false -> null
      - dns_endpoint_type                  = "Standard" -> null
      - https_traffic_only_enabled         = true -> null
      - id                                 = "/subscriptions/e1451471-4877-40c5-b65c-46fab5c164f6/resourceGroups/rg-webapp-prod/providers/Microsoft.Storage/storageAccounts/stwebappprod3i8r0t" -> null
      - infrastructure_encryption_enabled  = true -> null
      - is_hns_enabled                     = false -> null
      - large_file_share_enabled           = false -> null
      - local_user_enabled                 = true -> null
      - location                           = "eastus" -> null
      - min_tls_version                    = "TLS1_2" -> null
      - name                               = "stwebappprod3i8r0t" -> null
      - nfsv3_enabled                      = false -> null
      - primary_access_key                 = (sensitive value) -> null
      - primary_blob_connection_string     = (sensitive value) -> null
      - primary_blob_endpoint              = "https://stwebappprod3i8r0t.blob.core.windows.net/" -> null
      - primary_blob_host                  = "stwebappprod3i8r0t.blob.core.windows.net" -> null
      - primary_connection_string          = (sensitive value) -> null
      - primary_dfs_endpoint               = "https://stwebappprod3i8r0t.dfs.core.windows.net/" -> null
      - primary_dfs_host                   = "stwebappprod3i8r0t.dfs.core.windows.net" -> null
      - primary_file_endpoint              = "https://stwebappprod3i8r0t.file.core.windows.net/" -> null
      - primary_file_host                  = "stwebappprod3i8r0t.file.core.windows.net" -> null
      - primary_location                   = "eastus" -> null
      - primary_queue_endpoint             = "https://stwebappprod3i8r0t.queue.core.windows.net/" -> null
      - primary_queue_host                 = "stwebappprod3i8r0t.queue.core.windows.net" -> null
      - primary_table_endpoint             = "https://stwebappprod3i8r0t.table.core.windows.net/" -> null
      - primary_table_host                 = "stwebappprod3i8r0t.table.core.windows.net" -> null
      - primary_web_endpoint               = "https://stwebappprod3i8r0t.z13.web.core.windows.net/" -> null
      - primary_web_host                   = "stwebappprod3i8r0t.z13.web.core.windows.net" -> null
      - public_network_access_enabled      = false -> null
      - queue_encryption_key_type          = "Service" -> null
      - resource_group_name                = "rg-webapp-prod" -> null
      - secondary_access_key               = (sensitive value) -> null
      - secondary_connection_string        = (sensitive value) -> null
      - secondary_location                 = "westus" -> null
      - sftp_enabled                       = false -> null
      - shared_access_key_enabled          = false -> null
      - table_encryption_key_type          = "Service" -> null
      - tags                               = {
          - "Component"       = "Storage"
          - "CostCenter"      = "Engineering"
          - "Criticality"     = "High"
          - "Environment"     = "prod"
          - "ManagedBy"       = "Terraform"
          - "Owner"           = "DevTeam"
          - "Project"         = "webapp"
          - "SecurityControl" = "High"
          - "Service"         = "DataStorage"
        } -> null
        # (56 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = true -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = true -> null
            # (1 unchanged attribute hidden)

          - container_delete_retention_policy {
              - days = 30 -> null
            }

          - delete_retention_policy {
              - days                     = 30 -> null
              - permanent_delete_enabled = false -> null
            }
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Deny" -> null
          - ip_rules                   = [
              - "82.65.43.153",
            ] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_application_insights.main will be created
  + resource "azurerm_application_insights" "main" {
      + app_id                              = (known after apply)
      + application_type                    = "web"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "eastus2"
      + name                                = "appi-webapp-prod"
      + resource_group_name                 = "rg-webapp-prod"
      + retention_in_days                   = 90
      + sampling_percentage                 = 100
      + tags                                = {
          + "Component"       = "Monitoring"
          + "CostCenter"      = "Engineering"
          + "Criticality"     = "High"
          + "Environment"     = "prod"
          + "ManagedBy"       = "Terraform"
          + "Owner"           = "DevTeam"
          + "Project"         = "webapp"
          + "SecurityControl" = "High"
          + "Service"         = "ApplicationInsights"
        }
      + workspace_id                        = (known after apply)
    }

  # azurerm_key_vault.main will be created
  + resource "azurerm_key_vault" "main" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "eastus2"
      + name                            = "kv-webapp-prod-3i8r0t"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + rbac_authorization_enabled      = false
      + resource_group_name             = "rg-webapp-prod"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tags                            = {
          + "Component"       = "Security"
          + "CostCenter"      = "Engineering"
          + "Criticality"     = "High"
          + "Environment"     = "prod"
          + "ManagedBy"       = "Terraform"
          + "Owner"           = "DevTeam"
          + "Project"         = "webapp"
          + "SecurityControl" = "High"
          + "Service"         = "KeyVault"
        }
      + tenant_id                       = "4140d426-ef7b-4d54-898e-d617ef5335ec"
      + vault_uri                       = (known after apply)

      + contact (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
          + ip_rules       = [
              + "82.65.43.153",
            ]
        }
    }

  # azurerm_key_vault_access_policy.current_user will be created
  + resource "azurerm_key_vault_access_policy" "current_user" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Get",
          + "List",
          + "Create",
          + "Delete",
          + "Recover",
          + "Backup",
          + "Restore",
          + "Purge",
        ]
      + key_vault_id       = (known after apply)
      + object_id          = "0d49ce5d-a46d-4e3a-bd30-aea5ec67578f"
      + secret_permissions = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
          + "Backup",
          + "Restore",
          + "Purge",
        ]
      + tenant_id          = "4140d426-ef7b-4d54-898e-d617ef5335ec"
    }

  # azurerm_key_vault_access_policy.webapp will be created
  + resource "azurerm_key_vault_access_policy" "webapp" {
      + id                 = (known after apply)
      + key_vault_id       = (known after apply)
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = (known after apply)
    }

  # azurerm_key_vault_secret.sql_password will be created
  + resource "azurerm_key_vault_secret" "sql_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sql-admin-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "Component"       = "Security"
          + "CostCenter"      = "Engineering"
          + "Criticality"     = "High"
          + "Environment"     = "prod"
          + "ManagedBy"       = "Terraform"
          + "Owner"           = "DevTeam"
          + "Project"         = "webapp"
          + "SecurityControl" = "High"
          + "Service"         = "Secret"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_linux_web_app.main will be created
  + resource "azurerm_linux_web_app" "main" {
      + app_settings                                   = (known after apply)
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "eastus2"
      + name                                           = "app-webapp-prod-3i8r0t"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "rg-webapp-prod"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "Component"       = "Compute"
          + "CostCenter"      = "Engineering"
          + "Criticality"     = "High"
          + "Environment"     = "prod"
          + "ManagedBy"       = "Terraform"
          + "Owner"           = "DevTeam"
          + "Project"         = "webapp"
          + "Runtime"         = "Node.js"
          + "SecurityControl" = "High"
          + "Service"         = "WebApp"
        }
      + virtual_network_backup_restore_enabled         = false
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + connection_string {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "FtpsOnly"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/health"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version = "18-lts"
            }

          + cors {
              + allowed_origins     = [
                  + "*",
                ]
              + support_credentials = false
            }
        }
    }

  # azurerm_log_analytics_workspace.main will be created
  + resource "azurerm_log_analytics_workspace" "main" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = (known after apply)
      + local_authentication_enabled    = (known after apply)
      + location                        = "eastus2"
      + name                            = "log-webapp-prod"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-webapp-prod"
      + retention_in_days               = 90
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "Component"       = "Monitoring"
          + "CostCenter"      = "Engineering"
          + "Criticality"     = "High"
          + "Environment"     = "prod"
          + "ManagedBy"       = "Terraform"
          + "Owner"           = "DevTeam"
          + "Project"         = "webapp"
          + "SecurityControl" = "High"
          + "Service"         = "LogAnalytics"
        }
      + workspace_id                    = (known after apply)
    }

  # azurerm_mssql_database.main will be created
  + resource "azurerm_mssql_database" "main" {
      + auto_pause_delay_in_minutes                                = (known after apply)
      + collation                                                  = (known after apply)
      + create_mode                                                = "Default"
      + creation_source_database_id                                = (known after apply)
      + enclave_type                                               = (known after apply)
      + geo_backup_enabled                                         = true
      + id                                                         = (known after apply)
      + ledger_enabled                                             = (known after apply)
      + license_type                                               = (known after apply)
      + maintenance_configuration_name                             = (known after apply)
      + max_size_gb                                                = 50
      + min_capacity                                               = (known after apply)
      + name                                                       = "sqldb-webapp-prod"
      + read_replica_count                                         = (known after apply)
      + read_scale                                                 = (known after apply)
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = (known after apply)
      + secondary_type                                             = (known after apply)
      + server_id                                                  = (known after apply)
      + sku_name                                                   = "Basic"
      + storage_account_type                                       = "Geo"
      + tags                                                       = {
          + "Component"       = "Database"
          + "CostCenter"      = "Engineering"
          + "Criticality"     = "High"
          + "Environment"     = "prod"
          + "ManagedBy"       = "Terraform"
          + "Owner"           = "DevTeam"
          + "Project"         = "webapp"
          + "SecurityControl" = "High"
          + "Service"         = "SQLDatabase"
        }
      + transparent_data_encryption_enabled                        = true
      + transparent_data_encryption_key_automatic_rotation_enabled = false
      + zone_redundant                                             = (known after apply)

      + long_term_retention_policy (known after apply)

      + short_term_retention_policy {
          + backup_interval_in_hours = (known after apply)
          + retention_days           = 35
        }

      + threat_detection_policy (known after apply)
    }

  # azurerm_mssql_firewall_rule.azure_services will be created
  + resource "azurerm_mssql_firewall_rule" "azure_services" {
      + end_ip_address   = "0.0.0.0"
      + id               = (known after apply)
      + name             = "AllowAzureServices"
      + server_id        = (known after apply)
      + start_ip_address = "0.0.0.0"
    }

  # azurerm_mssql_server.main will be created
  + resource "azurerm_mssql_server" "main" {
      + administrator_login                      = (sensitive value)
      + administrator_login_password             = (sensitive value)
      + administrator_login_password_wo          = (write-only attribute)
      + connection_policy                        = "Default"
      + express_vulnerability_assessment_enabled = false
      + fully_qualified_domain_name              = (known after apply)
      + id                                       = (known after apply)
      + location                                 = "eastus2"
      + minimum_tls_version                      = "1.2"
      + name                                     = "sql-webapp-prod-3i8r0t"
      + outbound_network_restriction_enabled     = false
      + primary_user_assigned_identity_id        = (known after apply)
      + public_network_access_enabled            = true
      + resource_group_name                      = "rg-webapp-prod"
      + restorable_dropped_database_ids          = (known after apply)
      + tags                                     = {
          + "Component"       = "Database"
          + "CostCenter"      = "Engineering"
          + "Criticality"     = "High"
          + "Environment"     = "prod"
          + "ManagedBy"       = "Terraform"
          + "Owner"           = "DevTeam"
          + "Project"         = "webapp"
          + "SecurityControl" = "High"
          + "Service"         = "SQLServer"
        }
      + version                                  = "12.0"

      + azuread_administrator {
          + azuread_authentication_only = false
          + login_username              = "0d49ce5d-a46d-4e3a-bd30-aea5ec67578f"
          + object_id                   = "0d49ce5d-a46d-4e3a-bd30-aea5ec67578f"
          + tenant_id                   = "4140d426-ef7b-4d54-898e-d617ef5335ec"
        }
    }

  # azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "rg-webapp-prod"
      + tags     = {
          + "CostCenter"      = "Engineering"
          + "Criticality"     = "High"
          + "Environment"     = "prod"
          + "ManagedBy"       = "Terraform"
          + "Owner"           = "DevTeam"
          + "Project"         = "webapp"
          + "SecurityControl" = "High"
        }
    }

  # azurerm_service_plan.main will be created
  + resource "azurerm_service_plan" "main" {
      + id                              = (known after apply)
      + kind                            = (known after apply)
      + location                        = "eastus2"
      + maximum_elastic_worker_count    = 10
      + name                            = "asp-webapp-prod"
      + os_type                         = "Linux"
      + per_site_scaling_enabled        = false
      + premium_plan_auto_scale_enabled = false
      + reserved                        = (known after apply)
      + resource_group_name             = "rg-webapp-prod"
      + sku_name                        = "B1"
      + tags                            = {
          + "Component"       = "Compute"
          + "CostCenter"      = "Engineering"
          + "Criticality"     = "High"
          + "Environment"     = "prod"
          + "ManagedBy"       = "Terraform"
          + "Owner"           = "DevTeam"
          + "Project"         = "webapp"
          + "SecurityControl" = "High"
          + "Service"         = "AppServicePlan"
        }
      + worker_count                    = 2
    }

  # module.storage_account_main.azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "GRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = true
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "eastus2"
      + min_tls_version                    = "TLS1_2"
      + name                               = "stwebappprod3i8r0t"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = false
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-webapp-prod"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "Component"       = "Storage"
          + "CostCenter"      = "Engineering"
          + "Criticality"     = "High"
          + "Environment"     = "prod"
          + "ManagedBy"       = "Terraform"
          + "Owner"           = "DevTeam"
          + "Project"         = "webapp"
          + "SecurityControl" = "High"
          + "Service"         = "DataStorage"
        }

      + blob_properties {
          + change_feed_enabled      = true
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = true

          + container_delete_retention_policy {
              + days = 30
            }

          + delete_retention_policy {
              + days                     = 30
              + permanent_delete_enabled = false
            }
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Deny"
          + ip_rules                   = [
              + "82.65.43.153",
            ]
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.storage_account_main.modtm_telemetry.telemetry[0] will be updated in-place
  ~ resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
        id               = "390f237f-559e-475d-853f-c1b866a76c81"
      + nonce            = (known after apply)
      ~ tags             = {
          ~ "location"        = "eastus" -> "eastus2"
            "module_source"   = "registry.terraform.io/Azure/avm-res-storage-storageaccount/azurerm"
            "module_version"  = "0.6.4"
            "random_id"       = "bf29845f-b438-c298-2926-7afba0ccb3fe"
            "subscription_id" = "e1451471-4877-40c5-b65c-46fab5c164f6"
            "tenant_id"       = "4140d426-ef7b-4d54-898e-d617ef5335ec"
        }
    }

Plan: 13 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ application_insights_connection_string   = (sensitive value)
  ~ application_insights_instrumentation_key = (sensitive value)
  + deployment_summary                       = (sensitive value)
  ~ key_vault_uri                            = "https://kv-webapp-prod-3i8r0t.vault.azure.net/" -> (known after apply)
  ~ location                                 = "eastus" -> "eastus2"
  ~ log_analytics_workspace_id               = "1dd319e7-a23f-4095-8545-f76c6ad10e04" -> (known after apply)
  ~ resource_group_id                        = "/subscriptions/e1451471-4877-40c5-b65c-46fab5c164f6/resourceGroups/rg-webapp-prod" -> (known after apply)
  + sql_connection_string                    = (sensitive value)
  ~ sql_server_fqdn                          = "sql-webapp-prod-3i8r0t.database.windows.net" -> (known after apply)
  ~ storage_account_connection_string        = (sensitive value)
  ~ storage_account_primary_endpoint         = (sensitive value)
  + web_app_identity_principal_id            = (known after apply)
  + web_app_name                             = "app-webapp-prod-3i8r0t"
  + web_app_url                              = (known after apply)
```
</details>

_Commit: b21e8c1_
